Catalogs/ДействияМедосмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДействияМедосмотра</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийМедицинскогоОсмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОграниченияДействийМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьВПрограммеПрохождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляОтметкиИсследования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКабинетаДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаключенияПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсследования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсследованийДействийМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязьСКлассификатором</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнструментальныеИсследования</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДействияМедосмотровПараметрыАвтозаключений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДействияМедосмотровПараметрыАвтозаключений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДействиеМедосмотра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонОсмотра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныHTML</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДействийМедицинскогоОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДействийМедицинскогоОсмотра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Врач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исследование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыИсследованийДействийМедосмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыИсследованийДействийМедосмотра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИнструментальноеИсследование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛабораторноеИсследование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДействияМедосмотра/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаПечать.Доступность = Объект.Вид = Перечисления.ВидыДействийМедицинскогоОсмотра.Исследование;
	Элементы.НомерКабинетаДляПечати.Доступность = ВычислитьДоступностьНомераКабинета(Объект);
	
	Элементы.Врач.Доступность = Объект.ПечататьВПрограммеПрохождения И Не Объект.ТолькоДляОтметкиИсследования;
	Элементы.ТолькоДляОтметкиИсследования.Доступность = Объект.ПечататьВПрограммеПрохождения;
	
	Элементы.ТекстЗаключенияПоУмолчанию.ПодсказкаВвода = МедосмотрыКлиентСервер.ТекстЗаключенияПоУмолчанию();
	Элементы.НаименованиеДляПечати.ПодсказкаВвода = Объект.Наименование;
	
	Элементы.ВидИсследования.Доступность = Объект.Вид = Перечисления.ВидыДействийМедицинскогоОсмотра.Исследование;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АвтоформированиеЗаключения(Команда)
	
	Оповещение = Новый ОписаниеОповещения("АвтоформированиеЗаключенияПродолжение", ЭтотОбъект);
	РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтотОбъект,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоформированиеЗаключенияПродолжение(Результат, Параметры) Экспорт
	
	Отбор = Новый Структура("ДействиеМедосмотра", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.ДействияМедосмотровПараметрыАвтозаключений.ФормаСписка", ПараметрыФормы, ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Элементы.НаименованиеДляПечати.ПодсказкаВвода = Объект.Наименование;
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	ЭтоИсследование = Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыДействийМедицинскогоОсмотра.Исследование");
	
	Элементы.ГруппаПечать.Доступность = ЭтоИсследование;
	Элементы.НомерКабинетаДляПечати.Доступность = ВычислитьДоступностьНомераКабинета(Объект);
	Элементы.ВидИсследования.Доступность = ЭтоИсследование;
	
	Объект.СвязьСКлассификатором = Неопределено;
	ОбновитьСвязьСКлассификаторомПоВиду();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьВПрограммеПрохожденияПриИзменении(Элемент)
	Элементы.Врач.Доступность = Объект.ПечататьВПрограммеПрохождения;
	Элементы.ТолькоДляОтметкиИсследования.Доступность = Объект.ПечататьВПрограммеПрохождения;
	Элементы.НомерКабинетаДляПечати.Доступность = ВычислитьДоступностьНомераКабинета(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоДляОтметкиИсследованияПриИзменении(Элемент)
	Объект.Врач = Неопределено;
	Элементы.Врач.Доступность = Объект.ПечататьВПрограммеПрохождения И Не Объект.ТолькоДляОтметкиИсследования;
	Элементы.НомерКабинетаДляПечати.Доступность = ВычислитьДоступностьНомераКабинета(Объект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВычислитьДоступностьНомераКабинета(Знач Объект)
	
	Если Объект.Вид <> ПредопределенноеЗначение("Перечисление.ВидыДействийМедицинскогоОсмотра.Исследование")
		Или (Объект.ПечататьВПрограммеПрохождения И Не Объект.ТолькоДляОтметкиИсследования)
	Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСвязьСКлассификаторомПоВиду()
	
	Если Не ЗначениеЗаполнено(Объект.Вид) 
		Или Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыДействийМедицинскогоОсмотра.Исследование") 
		И Не ЗначениеЗаполнено(Объект.ВидИсследования)
	Тогда
		Элементы.СвязьСКлассификатором.Видимость = Ложь;
		Возврат;
	Иначе
		Элементы.СвязьСКлассификатором.Видимость = Истина;
	КонецЕсли;
	
	ПараметрыВыбораПоВидуДействия = Новый Массив;
	
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыДействийМедицинскогоОсмотра.Врач") Тогда
		
		Элементы.СвязьСКлассификатором.Заголовок = НСтр("ru='Должность исполнителя'");
		
		Массив = Новый Массив(); 
		Массив.Добавить(Тип("СправочникСсылка.КлассификаторыМинЗдрава")); 
		ОписаниеТиповОтбор = Новый ОписаниеТипов(Массив);
		Элементы.СвязьСКлассификатором.ОграничениеТипа = ОписаниеТиповОтбор;
		
		ПараметрыВыбораПоВидуДействия.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ДолжностиРаботниковМедОрганизаций")));
		Элементы.СвязьСКлассификатором.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПоВидуДействия);
		
	ИначеЕсли Объект.ВидИсследования = ПредопределенноеЗначение("Перечисление.ВидыИсследованийДействийМедосмотра.ИнструментальноеИсследование") Тогда
		
		Элементы.СвязьСКлассификатором.Заголовок = НСтр("ru='Инструментальное исследование'");
		Массив = Новый Массив(); 
		Массив.Добавить(Тип("СправочникСсылка.ИнструментальныеИсследования")); 
		ОписаниеТиповОтбор = Новый ОписаниеТипов(Массив);
		Элементы.СвязьСКлассификатором.ОграничениеТипа = ОписаниеТиповОтбор;
		
	Иначе
		
		Элементы.СвязьСКлассификатором.Заголовок = НСтр("ru='Лабораторное исследование'");
		
		Массив = Новый Массив(); 
		Массив.Добавить(Тип("СправочникСсылка.КлассификаторыМинЗдрава")); 
		ОписаниеТиповОтбор = Новый ОписаниеТипов(Массив);
		Элементы.СвязьСКлассификатором.ОграничениеТипа = ОписаниеТиповОтбор;
		
		ПараметрыВыбораПоВидуДействия.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ПрофилиЛабораторныхИсследований")));
		Элементы.СвязьСКлассификатором.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПоВидуДействия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИсследованияПриИзменении(Элемент)
	Объект.СвязьСКлассификатором = Неопределено;
	ОбновитьСвязьСКлассификаторомПоВиду();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСвязьСКлассификаторомПоВиду();
КонецПроцедуры
 
#КонецОбласти
